Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: In the following example, the file My Filename.txt is assumed to be in A_WorkingDir:
ja: 以下の例では、My Filename.txtがA_WorkingDirにあると仮定しています：

source: In the following example, the file My Filename.txt is assumed to be in A_WorkingDir: FileAppend "A Line of Text", "My Filename.txt".
ja: 以下の例では、My Filename.txtがA_WorkingDirにあると仮定しています：FileAppend "一行のテキスト", "マイファイル名.txt"。

source: In the following example, the hotkey Win+N is configured to launch Notepad.
ja: 次の例では、ホットキーWin+Nがメモ帳を起動するように設定されています。

source: In the following example, the new GMem object is freed only after MsgBox has returned:
ja: 次の例では、新しいGMemオブジェクトはMsgBoxが返った後にのみ解放される：

source: In the following example, the outer quotes are highlighted in yellow:
ja: 以下の例では、外側の引用符が黄色で強調表示されています：

source: In the following example, the property is declared as static so that the indexing operator can be used on the Env class itself.
ja: 以下の例では、Envクラス自体でインデックス演算子を使用できるように、プロパティはstaticとして宣言されています。

source: In the following example, the right Ctrl performs a different action depending on whether Notepad or Calculator is the active window:
ja: 次の例では、右Ctrlは、メモ帳と電卓のどちらがアクティブなウィンドウであるかによって、異なる動作をします：

source: In the following example, the script waits for a window whose title contains My File.txt and whose class is Notepad:
ja: 次の例では、スクリプトは、タイトルがMy File.txt 、クラスがNotepadのウィンドウを待つ：

source: In the following example, the second line is appended to the first because it begins with a comma:
ja: 次の例では、2行目はコンマで始まっているため、1行目に追加される：

source: In the following example, you would hold down the right Alt and press J or K to navigate the alt-tab menu:
ja: 次の例では、右のAltを押しながら、JまたはKを押して、alt-tabメニューを操作することになります：

source: In the following example, you would hold the left Ctrl and press CapsLock to display the menu and advance forward in it.
ja: 次の例では、左Ctrlを押しながらCapsLockを押すと、メニューが表示され、その中で先に進むことができます。

source: In the following example, you would press F1 to display the menu and advance forward in it.
ja: 次の例では、F1キーを押してメニューを表示し、その中で先に進むことになります。

source: In the next example, the Win+R hotkey, which is used to open the RUN window, is completely disabled:
ja: 次の例では、RUNウィンドウを開くのに使われるWin+Rホットキーが完全に無効になっています：

source: In the next example, the OK button is made the new default button:
ja: 次の例では、OKボタンが新しいデフォルトボタンになります：

source: In the parameters of these directives, the following escape sequences are supported:
ja: これらのディレクティブのパラメータでは、以下のエスケープシーケンスがサポートされています：

source: In the parameters of these directives, the following escape sequences are supported: ``, `,, `n, `r and `t.
ja: これらのディレクティブのパラメータでは、以下のエスケープシーケンスがサポートされています：``、`,、`n、`r、`t。

source: In the rare case where two groups of radio buttons are added consecutively (with no other control types in between them), this style may be applied manually to the first control of the second radio group, which splits it off from the first.
ja: ラジオボタンの2つのグループが連続して追加される（その間に他のコントロールタイプがない）まれなケースでは、このスタイルを2番目のラジオグループの最初のコントロールに手動で適用して、最初のコントロールから分離することができる。

source: In the registry, REG_DWORD values are always expressed as positive decimal numbers.
ja: レジストリでは、REG_DWORDの値は常に正の10進数で表現されます。

source: In the same way, control in a program or script usually flows from one statement to the next statement.
ja: 同じように、プログラムやスクリプトの制御は、通常、あるステートメントから次のステートメントへと流れます。

source: In the two examples above, the Run function receives the string wordpad.exe "C:\Program Files\AutoHotkey\license.txt".
ja: 上の2つの例では、Run関数がwordpad.exe "C:\Program Files\AutoHotkey\license.txt"という文字列を受け取っています。

source: In these cases, an exception will usually not be thrown, but all the retrieved fields will be empty.
ja: このような場合、通常、例外は発生しませんが、取得したフィールドはすべて空となります。

source: In these cases, consider using ControlSend or PostMessage, which should be able to interact with some of these non-standard menu bars.
ja: このような場合は、ControlSendや PostMessageを使用することを検討してみてください。

source: In these cases, the first expression with any given combination of criteria can be identified by either the expression or the window criteria.
ja: これらの場合、任意の基準の組み合わせを持つ最初の表現は、表現またはウィンドウ基準のいずれかによって特定することができます。

source: In these cases, the result of the sub-expression is always a number, not a variable reference.
ja: このような場合、部分式の結果は常に数値であり、変数参照ではない。

source: In this case the drive is not required to be assigned a drive letter.
ja: この場合、ドライブにドライブレターを割り当てる必要はありません。

source: In this case, ClickCount is the number of notches to turn the wheel.
ja: この場合、ClickCountはホイールを回すためのノッチ数です。

source: In this case, other inherits foo and test from thing.
ja: この場合、otherは thingからfooと testを継承する。

source: In this case, CapsLock's state (on or off) is not changed when it is used to launch the hotkey.
ja: この場合、ホットキーの起動に使用されても、CapsLockの状態（オンまたはオフ）は変更されません。

source: In this case, if DirName is not empty, no action is taken and an exception is thrown.
ja: この場合、DirNameが空でない場合は何もせず、例外がスローされます。

source: In this case, the background color of a text control is changed to a custom color.
ja: この場合、テキストコントロールの背景色はカスタムカラーに変更されます。

source: In this case, the current capacity will be returned rather than 0.
ja: この場合、0ではなく現在の容量が返される。

source: In this case, the last parameter is the string to display.
ja: この場合、最後のパラメータは表示する文字列となります。

source: In this case, the remainder of the line is taken as the function's parameter list.
ja: この場合、行の残りは関数のパラメータリストとして扱われます。

source: In this case, the return value is an Array instead of a string.
ja: この場合、戻り値は文字列ではなく、配列になります。

source: In this case, the script has nothing else to do, so it automatically exits.
ja: この場合、スクリプトは他にすることがないので、自動的に終了します。

source: In this example, the Exit function terminates the call_exit function as well as the calling function.
ja: この例では、Exit関数がcall_exit関数だけでなく、呼び出し関数も終了させる。

source: In this example, the master controls are at the top, followed by the first four components:
ja: この例では、マスターコントロールが一番上にあり、その後に最初の4つのコンポーネントが続きます：

source: In this example, the master controls are at the top, followed by the first four components: Microphone, FrontMic, Line In, and Side.
ja: この例では、マスターコントロールが一番上にあり、その後に最初の4つのコンポーネントが続きます：マイク、フロントマイク、ライン入力、サイド。

source: In this example, the value "one" is stored at index 1, and the value 17 is stored at index 4.
ja: この例では、値"one"がインデックス1に、値17がインデックス4に格納されている。

source: In this example, the value "Ctrl" is associated with the key "^", and the value "Alt" is associated with the key "!".
ja: この例では、値"Ctrl"がキー"^"に関連付けられ、値"Alt"がキー"!"に関連付けられる。

source: In this example, the value "Yellow" is stored in the property Color and the value 3 is stored in the property Price.
ja: この例では、値"Yellow"がプロパティ"Color"に、値 3がプロパティ "Price"に格納されている。

source: In this mode, RegEx callouts equivalent to (?C255) are inserted before each item in the pattern.
ja: このモードでは、(? C255)は、パターン内の各項目の前に挿入される。

source: In this mode, VarSetStrCapacity returns the length rather than the capacity.
ja: このモードでは、VarSetStrCapacityは容量ではなく長さを返す。

source: In this mode, the delay is actually a PressDuration rather than a delay between keystrokes.
ja: このモードでは、遅延はキーストローク間の遅延ではなく、実際にはPressDurationとなります。

source: In this respect, they are similar to hotkeys except that they are typically composed of more than one character (that is, a string).
ja: この点では、一般的に複数の文字（つまり文字列）で構成されていることを除けば、ホットキーと似ています。

source: In this view and all the others except Report, the text in columns other than the first is not visible.
ja: このビューおよびReport以外のビューでは、最初の列以外の列のテキストは表示されません。

source: In those cases, ParamCount must be set to the size of the parameter list, where Int64 and Double count as two 32-bit parameters.
ja: その場合、ParamCountには、Int64とDoubleを2つの32ビットパラメータとしてカウントするパラメータリストのサイズを設定する必要があります。

source: In v1 it was equivalent to var := "", but silently failed if combined with another expression - for example:
ja: v1で、これはvar := ""と等価でしたが、他の式と組み合わせると無言で失敗します：

source: In v1 it was equivalent to var := "", but silently failed if combined with another expression - for example: x :=, y :=.
ja: v1で、これはvar := ""と等価でしたが、他の式と組み合わせると無言で失敗します：x :=, y :=。

source: In v1 this caused ErrorLevel to be set to 1, which mostly went unnoticed.
ja: v1ではErrorLevelが1に設定されていましたが、これはほとんど気づかれませんでした。

source: In v1, a variable can contain both a string and a cached binary number, which is updated whenever the variable is used as a number.
ja: v1では、変数に文字列とキャッシュされた2進数の両方を含めることができ、変数が数値として使用されるたびに更新されます。

source: In v1, address-of returned the address of var's internal string buffer, even if it contained a number (but not an object).
ja: v1では、address-ofは、varの内部文字列バッファのアドレスを返し、たとえそれが数値（オブジェクトではない）を含んでいたとしても、そのアドレスを返していました。

source: In views other than icon view there is no change.
ja: アイコン・ビュー以外では変化はない。

source: InStr - Syntax & Usage | AutoHotkey v2
ja: InStr - 構文と使用法｜AutoHotkey v2

source: InStr now searches right-to-left when Occurrence is negative (which previously caused a result of 0), and no longer searches right-to-left if a negative StartingPos is used with a positive Occurrence.
ja: InStrは、Occurrenceが負の場合（以前は結果が0になる）、右から左に検索するようになり、負のStartingPosが正のOccurrenceで使用されても右から左に検索しないようになりました。

source: InStr searches only up to the first binary zero (null-terminator), whereas RegExMatch searches the entire length of the string even if it includes binary zero.
ja: InStrは最初のバイナリゼロ（ヌルターミネーター）までしか検索しませんが、RegExMatchはバイナリゼロが含まれていても、文字列の全長を検索しています。

source: Include a variable or sub-expression in the message.
ja: メッセージに変数や部分式を含める。

source: Include any special variables between % signs to see the (manipulated) contents.
ja: 操作された）内容を見るには、%記号の間に特別な変数を含める。

source: Include subsequently-executed lines in the history.
ja: ヒストリーの中で、その後に実行された行を含みます。

source: Includes a sizing grip at the right end of the status bar.
ja: ステータスバーの右端にサイズ調整用のグリップを装備。

source: Includes a text file inside the compiled version of the script.
ja: コンパイルされたバージョンのスクリプトの中に、テキストファイルを含む。

source: Includes subsequently-executed lines in the history.
ja: ヒストリーの中で、その後に実行された行を含みます。

source: Includes the contents of the specified file into the current script.
ja: 指定されたファイルの内容を、現在のスクリプトに取り込みます。

source: Includes the specified file inside the compiled version of the script.
ja: 指定されたファイルを、コンパイルされたバージョンのスクリプトの中に含めます。

source: Including Variables
ja: 変数を含む

source: Including a variable inside a quoted string won't work; instead, we use concatenation to join literal strings together with variables.
ja: 引用符で囲まれた文字列の中に変数を入れてもうまくいかないので、代わりに連結を使ってリテラル文字列と変数を連結します。

source: Incoming parameters, if present, are stored as an array in the built-in variable A_Args, and can be accessed using array syntax.
ja: 入力パラメータがある場合は、組み込み変数A_Argsに配列として格納され、配列構文を使ってアクセスできる。

source: Increase SetKeyDelay.
ja: SetKeyDelayの増加。

source: Increase the master volume.
ja: マスターボリュームを大きくする。

source: Increase the volume
ja: 音量を上げる

source: Increases microphone recording volume by 20 percent.
ja: マイクロフォンのレコーディングボリュームを20パーセント上げます。

source: Increases microphone recording volume by 20 %.
ja: マイクの録音音量を20%上げる。

source: Increases the master volume by 10 percent.
ja: マスター音量を10パーセント上げます。

source: Increases the master volume by 10 %.
ja: マスターの音量を10%上げる。

source: Increasing the interval postpones the arrival of messages/events, which gives the current thread more time to finish.
ja: 間隔を広げると、メッセージ/イベントの到着が延期され、現在のスレッドが終了するまでの時間が長くなります。

source: Increasing the length changes which indices are considered valid, but the new elements have no value (as indicated by Has).
ja: 長さを長くすると、どのインデックスが有効とみなされるかが変わりますが、新しい要素には価値がありません（Hasで示されます）。

source: Increasing the message-check interval too much may reduce the responsiveness of various events such as GUI window repainting.
ja: メッセージチェックの間隔を広げすぎると、GUIウィンドウの再描画など各種イベントの応答性が低下する場合があります。

source: Increments or decrements an object's reference count.
ja: オブジェクトの参照カウントを増減させる。

source: Indentation
ja: インデント

source: Indentation has no set style, but it's best to keep everything consistent.
ja: インデントに決まったスタイルはありませんが、すべてを統一するのがベストです。

source: Indented:
ja: インデントされている：

source: Indic
ja: インド語

source: Indicate that the script is being restarted and should attempt to close a previous instance of the script (this is also used by the Reload function, internally).
ja: スクリプトが再起動され、スクリプトの以前のインスタンスを閉じようとしていることを示す（これは、内部的にReload関数でも使用される）。

source: Indicates that Filename is a file handle to wrap in an object.
ja: Filenameがオブジェクトにラップするためのファイルハンドルであることを示します。

source: Indicates that the stack trace was truncated, and there are N more stack entries not shown.
ja: スタックトレースが切り捨てられ、表示されていないスタック項目がN個以上あることを示します。

source: Indicates that this control is the first one in a group of controls.
ja: このコントロールがコントロールグループの最初のコントロールであることを示す。

source: Indicates the type of message box and the possible button combinations.
ja: メッセージボックスの種類と、可能なボタンの組み合わせを示します。

source: Indicates which icon to load from a file with multiple icons (generally an EXE or DLL file).
ja: 複数のアイコンを持つファイル（一般にEXEファイルやDLLファイル）から、どのアイコンを読み込むかを示します。

source: Indicates which types of files are shown by the dialog.
ja: ダイアログで表示されるファイルの種類を示します。

source: Information about editors with AutoHotkey support.
ja: AutoHotkeyをサポートするエディタに関する情報。

source: IniDelete - Syntax & Usage | AutoHotkey v2
ja: IniDelete - 構文と使用法｜AutoHotkey v2

source: IniRead - Syntax & Usage | AutoHotkey v2
ja: IniRead - 構文と使用法｜AutoHotkey v2

source: IniWrite - Syntax & Usage | AutoHotkey v2
ja: IniWrite - 構文と使用法｜AutoHotkey v2

source: Initial directory:
ja: 初期ディレクトリ：

source: Initial folder:
ja: 初期フォルダ：

source: Initial folder: $FileDir
ja: 初期フォルダ：$FileDir

source: Initialization consists of calling two static methods:
ja: 初期化は、2つの静的メソッドを呼び出すことからなる：

source: Initialization consists of calling two static methods: __Init and __New.
ja: 初期化は、2つの静的メソッドを呼び出すことからなる：__Init、__New。

source: Input (use InputHook)
ja: Input（InputHookを使用）

source: Input generated by any source other than AutoHotkey is never ignored as a result of this setting.
ja: AutoHotkey以外のソースで生成された入力は、この設定の結果、決して無視されることはありません。

source: Input has been called.
ja: 入力が呼び出されました。

source: Input is automatically re-enabled when the script closes.
ja: スクリプトが終了すると、入力は自動的に再有効化されます。

source: Input is re-enabled.
ja: 入力が再有効化されます。

source: Input values to be formatted and inserted into the final string.
ja: 最終的な文字列に整形して挿入される入力値。

source: InputBox - Syntax & Usage | AutoHotkey v2
ja: InputBox - 構文と使用法｜AutoHotkey v2

source: InputHook - Syntax & Usage | AutoHotkey v2
ja: InputHook - 構文と使用法｜AutoHotkey v2

source: InputHook Object
ja: InputHookオブジェクト

source: InputHook gives much more control over individual keys via the KeyOpt method.
ja: InputHookでは、KeyOptメソッドにより、個々のキーに対してより多くの制御を行うことができます。

source: InputHook is designed to allow different parts of the script to monitor input, with minimal conflicts.
ja: InputHookは、スクリプトの異なる部分が最小限の競合で入力を監視できるように設計されています。

source: InputHook vs. Input (v1)
ja: InputHookとInputの比較(v1)

source: InputHook's EndMods property reflects the logical state of the modifier keys at the time Input was terminated.
ja: InputHookのEndModsプロパティは、Inputが終了した時点の修飾キーの論理状態を反映しています。

source: Insert (or Ins)
ja: Insert（またはIns）

source: Insert one or more items at a given index using the InsertAt method:
ja: InsertAtメソッドを使用して、指定されたインデックスに1つ以上の項目を挿入します：

source: InsertAt is the counterpart of RemoveAt.
ja: InsertAtは、RemoveAtと対になるものです。

source: InsertAt method
ja: InsertAtメソッド

source: Inserts a carriage return (`r) before each linefeed (`n) if one is not already present.
ja: キャリッジリターン(`r)がまだ存在しない場合、各ラインフィード(`n)の前に挿入されます。

source: Inserts a new column at the specified column number, and returns the new column's position number.
ja: 指定された列番号に新しい列を挿入し、新しい列の位置番号を返す。

source: Inserts a new column at the specified column number.
ja: 指定されたカラム番号に新しいカラムを挿入します。

source: Inserts a new item before the specified item.
ja: 指定された項目の前に、新しい項目を挿入します。

source: Inserts a new row at the specified row number, and returns the new row number.
ja: 指定された行番号に新しい行を挿入し、その新しい行番号を返す。

source: Inserts a new row at the specified row number.
ja: 指定された行番号に新しい行を挿入する。

source: Inserts one or more values at a given position.
ja: 指定された位置に1つまたは複数の値を挿入します。

source: Inside a function, only that function's labels are visible/accessible to the script.
ja: 関数内では、その関数のラベルだけがスクリプトから見える／アクセスできる。

source: Inside a method or a property getter/setter, the keyword super can be used in place of this to access the superclass versions of methods or properties which are overridden in a derived class.
ja: メソッドやプロパティのゲッター/セッターの内部では、派生クラスでオーバーライドされているメソッドやプロパティのスーパークラスのバージョンにアクセスするために、thisの代わりにsuperキーワードを使用することができます。

source: Inside a quoted string, `" translates to a literal " and `' translates to a literal '.
ja: 引用符で囲まれた文字列の中では、`"はリテラル"に、`'はリテラル'に変換されます。

source: Inside the function, any reference to the parameter will actually access the caller's variable.
ja: 関数内部では、パラメータへの参照は、実際には呼び出し元の変数にアクセスすることになります。

source: Inspect all variables or a specific variable.
ja: すべての変数または特定の変数を検査する。

source: Inspect or edit variable contents.
ja: 変数の内容を検査または編集します。

source: Inspect variables - select a variable name, right-click, Inspect.
ja: 変数の検査 - 変数名を選択し、右クリックし、検査します。

source: Install the keyboard hook by calling InstallKeybdHook.
ja: InstallKeybdHookを呼び出して、キーボードフックをインストールします。

source: Install using command line options.
ja: コマンドラインオプションを使用してインストールします。

source: Install v1 as an additional version.
ja: 追加バージョンとしてv1をインストールする。

source: Install v1 first, and then v2.
ja: まずv1をインストールし、次にv2をインストールする。

source: InstallKeybdHook - Syntax & Usage | AutoHotkey v2
ja: InstallKeybdHook - 構文と使用法｜AutoHotkey v2

source: InstallMouseHook - Syntax & Usage | AutoHotkey v2
ja: InstallMouseHook - 構文と使用法｜AutoHotkey v2

source: Installation
ja: インストール

source: Installing AutoHotkey v1 and v2 into different directories is not necessary and is currently not supported.
ja: AutoHotkey v1とv2を異なるディレクトリにインストールする必要はなく、現在サポート対象外となっています。

source: Installing with v1
ja: v1でのインストール

source: Installs or uninstalls the keyboard hook.
ja: キーボードフックをインストールまたはアンインストールします。

source: Installs or uninstalls the mouse hook.
ja: マウスフックをインストールまたはアンインストールします。

source: Installs the keyboard hook unconditionally.
ja: キーボードフックを無条件でインストールします。

source: Installs the mouse hook unconditionally.
ja: マウスフックを無条件でインストールします。

source: Instance Variables
ja: インスタンス変数

source: Instance methods are defined as below, and are attached to the class's Prototype, which makes them accessible via any instance of the class.
ja: インスタンス・メソッドは以下のように定義され、クラスのプロトタイプにアタッチされます。

source: Instances are typically created by calling ClassName().
ja: インスタンスは通常、ClassName()を呼び出して作成します。

source: Instantiation is performed by calling the static Call method, as in myClass.Call() or myClass().
ja: インスタンス化は、myClass.Call()やmyClass()のように、静的なCallメソッドを呼び出すことで行われます。

source: Instead of RootKey, Key, write RootKey\Key.
ja: RootKey, Keyの代わりに、RootKeyKeyと書いてください。

source: Instead of RootKey, SubKey, write RootKey\SubKey.
ja: RootKey, SubKeyの代わりに、RootKey\SubKeyと書いてください。

source: Instead of A_ThisLabel, use function parameters.
ja: A_ThisLabelの代わりに、関数パラメータを使用します。

source: Instead of asking for help on every little thing, sometimes spending some time alone (sometimes hours or days) and trying to get something to work will help you learn faster.
ja: 些細なことでいちいち助けを求めるのではなく、時には一人で時間をかけて（時には数時間、数日かけて）何かを動かそうとすることが、より早く学ぶことにつながる。

source: Instead of producing a "null" or "undefined" value, any attempt to read a variable, property, array element or map item which has no value causes an UnsetError to be thrown.
ja: 「null」または「undefined」値を生成する代わりに、値を持たない変数、プロパティ、配列要素、マップアイテムを読み込もうとすると、UnsetErrorがスローされる。

source: Instead of replacement text, the hotstring accepts a function call or expression to execute.
ja: ホットストリングは、置換テキストの代わりに、実行する関数コールまたは式を受け付けます。

source: Instead of running the program file, you should generally run an .ahk file.
ja: 通常、実行ファイルを起動する代わりに、拡張子が.ahkのファイルを実行します。

source: Instead of waiting, the script can register an OnEnd function to be called when the Input is terminated.
ja: スクリプトは待つ代わりに、Inputが終了したときに呼び出されるOnEnd関数を登録することができます。

source: Instead use vk13 or the corresponding scan code.
ja: 代わりにvk13または対応するスキャンコードを使用してください。

source: Instead use the VK/SC method; e.g. x::+sc01A and y::+sc01B.
ja: 代わりにVK/SCメソッドを使用する。例えば、x::+sc01Aとy::+sc01B。

source: Instead, OnEvent can be used to register a callback function or method for each event of interest.
ja: 代わりに、OnEventを使用して、関心のあるイベントごとにコールバック関数またはメソッドを登録することができます。

source: Instead, a TypeError is thrown.
ja: 代わりにTypeErrorがスローされます。

source: Instead, a GUI object (and window) is created explicitly by instantiating the Gui class, as in GuiObj := Gui().
ja: その代わり、GUIオブジェクト（とウィンドウ）は、GuiObj := Gui()のようにGuiクラスをインスタンス化することで明示的に作成します。

source: Instead, a portion of the control is "invalidated" and is usually repainted after a brief delay, when the program checks its internal message queue.
ja: その代わり、制御の一部が「無効化」され、通常、プログラムが内部メッセージキューをチェックする際に、短い遅延の後に再描画されます。

source: Instead, a visible matching window is activated if one exists.
ja: その代わり、マッチング・ウインドウがあれば、それが表示される。

source: Instead, an average of 5 milliseconds will pass before an interruption occurs.
ja: その代わり、割り込みが発生するまでに平均5ミリ秒の時間が経過することになります。

source: Instead, check whether it is greater or less than another value.
ja: その代わりに、別の値より大きいか小さいかをチェックする。

source: Instead, each script should set the AppUserModelID of its process or windows to control grouping.
ja: 代わりに、各スクリプトは、グループ化を制御するために、そのプロセスまたはウィンドウのAppUserModelIDを設定する必要があります。

source: Instead, it always exits the current thread properly, and (if non-persistent) the script terminates only after the last thread exits.
ja: その代わり、常に現在のスレッドを適切に終了させ、（非永続的な場合）最後のスレッドが終了した後にのみスクリプトを終了させます。

source: Instead, it creates a series of events (messages) that flow directly to the active window (similar to ControlSend, but at a lower level).
ja: その代わりに、アクティブなウィンドウに直接流れる一連のイベント（メッセージ）を作成します（ControlSendと似ていますが、より低いレベルです）。

source: Instead, it defaults to no delay at all, which can be changed as shown in the following examples:
ja: その代わり、デフォルトでは全く遅延しないようになっていますが、以下の例のように変更することが可能です：

source: Instead, it is usually best to post or send the messages to the script's main window or one of its GUI windows.
ja: その代わりに、スクリプトのメインウィンドウまたはGUIウィンドウの1つにメッセージを投稿または送信するのが通常最適です。

source: Instead, it will immediately return 1 and the script will continue executing.
ja: その代わり、即座に1が返され、スクリプトの実行が継続される。

source: Instead, it will immediately return 1.
ja: 代わりに、すぐに1が返されます。

source: Instead, it will immediately return, allowing the script to resume.
ja: その代わり、スクリプトを再開できるように、即座にリターンします。

source: Instead, it will update the Last Found Window and return, allowing the script to continue execution.
ja: 代わりに、Last Found Windowを更新して戻り、スクリプトの実行を続行できるようにする。

source: Instead, its value is copied into a temporary VARIANT, which is passed using the variant type VT_BYREF|VT_VARIANT.
ja: 代わりに、その値は一時的なVARIANTにコピーされ、VT_BYREF|VT_VARIANTのバリアントタイプを使って渡されます。

source: Instead, just omit the operator, as in MyClass().
ja: 代わりに、MyClass()のように演算子を省略するだけです。

source: Instead, pass the variable explicitly or bind its value to a parameter.
ja: 代わりに、変数を明示的に渡すか、その値をパラメータにバインドしてください。

source: Instead, position it before the first hotkey you wish to have affected by it, which will result in all subsequent hotkeys using that value until another instance of this directive is encountered.
ja: 代わりに、このディレクティブの影響を受けさせたい最初のホットキーの前に位置させ、このディレクティブの別のインスタンスに出会うまで、後続のすべてのホットキーがその値を使用することになります。

source: Instead, position it immediately before the first hotkey you wish to have affected by it.
ja: 代わりに、その影響を受けさせたい最初のホットキーの直前に配置します。

source: Instead, post the WM_SYSCOMMAND message directly.
ja: 代わりに、WM_SYSCOMMANDメッセージを直接投稿してください。

source: Instead, specify `n for Enter and `t (or a literal tab) for Tab (see Escape Sequences for a complete list).
ja: 代わりに、Enterには`n、Tabには`t（またはリテラルタブ）を指定します（完全なリストはエスケープシーケンスを参照してください）。

source: Instead, statements are grouped by enclosing them in braces, as shown above.
ja: その代わりに、上の図のように中括弧で囲むことでステートメントをグループ化します。
